Revit 2027 API
NumberingSchema.ChangePartitioningValue Method
 Moves all elements of a numbering sequence from one partition to another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ChangePartitioningValue(
	string fromPartition,
	string newPartition
)
Public Sub ChangePartitioningValue (
	fromPartition As String,
	newPartition As String
)
public:
void ChangePartitioningValue(
	String^ fromPartition,
	String^ newPartition
)
member ChangePartitioningValue :
        fromPartition : string *
        newPartition : string -> unit
Parameters
fromPartition String
 Name of the partition that determines which numbering sequence to move. The sequence must exist already, otherwise an exception will be thrown.
newPartition String
 Name of a partition into which the source sequence is going to be moved.
Exceptions
Exception | Condition
ArgumentException |  The sequence fromPartition does not exist in the schema. -or- the given newPartition cannot be used as a valid name of a numbering partition because it contains characters that are considered invalid, such as non-printable characters or those that cannot be used in a file's name.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Either the schema or its document cannot be modified at present. -or- The value for the partition can only be changed if it is determined by one non-readonly Text parameter.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace